[
  {
    "name": "ParkSeeker",
    "id": 3,
    "breif-summary": "Easily find national parks, monuments, and lands to do the activities you love most",
    "highlights": ["Consumed API to display and sort data", "Fully responsive design", "Built in React, tested in Cypress"],
    "context": "This project was the final project during the third module (of four) during my time at Turing School of Software and Design. The project was used to showcase my skills in React, React Router, and e2e testing in Cypress which were learned over the course of the module. I also used this project to soliddify my skills in git, GitHub Projects, Agile workflow, CSS, and fetch APIs. This project was completed independently.",
    "techs": ["Cypress", "React", "React Router", "CSS", "Webpack", "GitHub", "Canva Wireframing", "Postman"],
    "summary": "The goal of this project was to create an application using an external api in order to solve a problem for a niche group of users. I love being in the outdoors, and some of my favorites trips have been those to National Parks and Museums. I created this application to allow users to easily sort parks by the activities they love while providing basic park information to kick start their trip planning. The UI is intentionally minimalistic and included limited details to encourage users to peruse their adventures without getting overwhelmed. There is a link to each parks home page available to the user if they want easy access to more information.",
    "gif": "",
    "img-one": "",
    "img-two": "",
    "img-three": ""
  },
  {
    "name": "Backyarder",
    "id": 2,
    "breif-summary": "",
    "highlights": ["", "", ""],
    "context": "",
    "techs": [],
    "summary": "",
    "gif": "",
    "img-one": "",
    "img-two": "",
    "img-three": ""
  },
  {
    "name": "",
    "id": 1,
    "breif-summary": "",
    "highlights": ["", "", ""],
    "context": "",
    "techs": [],
    "summary": "",
    "gif": "",
    "img-one": "",
    "img-two": "",
    "img-three": ""
  }
]